{
    "resetPassword": {
        "subject": "Réinitialisez votre mot de passe"
    },
    "tenant": {
        "create_failed": "Échec de la création du tenant. Veuillez réessayer plus tard.",
        "owner_exists": "Un propriétaire existe déjà pour ce tenant.",
        "missing": "Tenant information is required."
    },
    "mail": {
        "send_failed": "Échec de l'envoi de l'e-mail."
    },
    "auth": {
        "invalid_credentials": "Identifiants invalides.",
        "no_permission": "Vous n'avez pas la permission d'effectuer cette action.",
        "token_not_found": "Jeton d'authentification introuvable.",
        "invalid_token_payload": "Charge utile du jeton invalide.",
        "token_expired": "Le jeton d'authentification a expiré.",
        "invalid_token": "Jeton invalide ou expiré."
    },
    "user": {
        "email_exists": "Un utilisateur avec cet email existe déjà.",
        "manager_tenant_required": "tenantId est requis pour inscrire un gestionnaire.",
        "not_found": "Utilisateur non trouvé.",
        "get_failed": "Échec de récupération de l'utilisateur. Veuillez réessayer plus tard.",
        "update_failed": "Échec de mise à jour de l'utilisateur. Veuillez réessayer plus tard."
    },
    "product": {
        "sku_exists": "Un produit avec ce SKU existe déjà.",
        "not_found": "Produit introuvable.",
        "create_failed": "Échec de la création du produit. Veuillez réessayer plus tard.",
        "update_failed": "Échec de la mise à jour du produit. Veuillez réessayer plus tard.",
        "uom_not_found": "Unité de mesure introuvable."
    },
    "batch": {
        "already_exists": "Un lot avec ce numéro existe déjà pour ce produit.",
        "not_found": "Lot introuvable.",
        "create_failed": "Échec de la création du lot. Veuillez réessayer plus tard.",
        "list_failed": "Échec de la récupération des lots. Veuillez réessayer plus tard.",
        "query_failed": "Échec de la requête des lots. Veuillez réessayer plus tard."
    },
    "inventory_item": {
        "serial_exists": "Un article d'inventaire avec ce numéro de série existe déjà.",
        "not_found": "Article d'inventaire introuvable.",
        "not_found_by_serial": "Article d'inventaire introuvable avec ce numéro de série.",
        "create_failed": "Échec de la création de l'article d'inventaire. Veuillez réessayer plus tard.",
        "update_failed": "Échec de la mise à jour de l'article d'inventaire. Veuillez réessayer plus tard.",
        "list_failed": "Échec de la récupération des articles d'inventaire. Veuillez réessayer plus tard.",
        "query_failed": "Échec de la requête des articles d'inventaire. Veuillez réessayer plus tard.",
        "search_failed": "Échec de la recherche de l'article d'inventaire. Veuillez réessayer plus tard."
    },
    "database": {
        "env_missing": "La configuration du service est incomplète. Veuillez contacter le support.",
        "connect_failed": "Service temporairement indisponible. Veuillez réessayer plus tard."
    },
    "supplier": {
        "exists": "Un fournisseur avec le même téléphone ou e-mail existe déjà.",
        "create_failed": "Échec de la création du fournisseur. Veuillez réessayer plus tard.",
        "check_failed": "Échec de la vérification de l'unicité du fournisseur. Veuillez réessayer plus tard.",
        "list_failed": "Échec de la récupération de la liste des fournisseurs. Veuillez réessayer plus tard.",
        "not_found": "Fournisseur introuvable."
    },
    "uom": {
        "exists": "Une unité de mesure avec ce code existe déjà.",
        "create_failed": "Échec de la création de l'unité de mesure. Veuillez réessayer plus tard.",
        "list_failed": "Échec de la récupération des unités de mesure. Veuillez réessayer plus tard.",
        "base_not_found": "L'unité de base référencée est introuvable.",
        "invalid_factor": "Facteur de conversion invalide. Doit être un nombre positif.",
        "base_exists": "Une unité de base existe déjà pour ce locataire."
    },
    "log": {
        "create_failed": "Échec de l'enregistrement du journal. Veuillez réessayer plus tard.",
        "list_failed": "Échec de la récupération des journaux. Veuillez réessayer plus tard."
    },
    "category": {
        "create": {
            "duplicate": "Une catégorie avec ce nom et type existe déjà.",
            "parent_type_mismatch": "Le type de sous-catégorie doit correspondre au type de catégorie parent."
        },
        "not_found": "Catégorie introuvable.",
        "list": {
            "failed": "Échec de la récupération des catégories. Veuillez réessayer plus tard."
        },
        "update": {
            "duplicate": "Une catégorie avec ce nom et type existe déjà."
        },
        "delete": {
            "has_subcategories": "Impossible de supprimer une catégorie avec des sous-catégories.",
            "has_transactions": "Impossible de supprimer une catégorie utilisée dans des transactions."
        },
        "subcategories": {
            "query_failed": "Échec de la récupération des sous-catégories. Veuillez réessayer plus tard."
        },
        "tree": {
            "build_failed": "Échec de la construction de l'arborescence des catégories. Veuillez réessayer plus tard."
        }
    },
    "account": {
        "create": {
            "negative_initial_balance": "Le solde initial ne peut pas être négatif.",
            "duplicate": "Un compte avec ce nom, type et devise existe déjà."
        },
        "not_found": "Compte introuvable.",
        "list": {
            "failed": "Échec de la récupération des comptes. Veuillez réessayer plus tard."
        },
        "category_required": "La catégorie est requise pour cette opération.",
        "category_invalid": "Catégorie invalide. Catégorie introuvable.",
        "category_type_mismatch": "Le type de catégorie ne correspond pas au type d'opération.",
        "deposit": {
            "failed": "Échec du dépôt sur le compte. Veuillez réessayer plus tard."
        },
        "withdraw": {
            "insufficient_funds": "Fonds insuffisants pour le retrait."
        },
        "transfer": {
            "currency_mismatch": "Impossible de transférer entre des comptes avec des devises différentes.",
            "insufficient_funds": "Fonds insuffisants pour le transfert.",
            "failed": "Le transfert a échoué. La transaction a été annulée."
        },
        "transactions": {
            "query_failed": "Échec de la récupération des transactions. Veuillez réessayer plus tard."
        }
    }
}