{
    "resetPassword": {
        "subject": "Weka upya nenosiri yako"
    },
    "tenant": {
        "create_failed": "Imeshindikana kuunda duka. Tafadhali jaribu tena baadaye.",
        "owner_exists": "An owner already exists for this tenant.",
        "missing": "Tenant information is required."
    },
    "mail": {
        "send_failed": "Imeshindikana kutuma barua pepe."
    },
    "auth": {
        "invalid_credentials": "Invalid credentials.",
        "no_permission": "You do not have permission to perform this action.",
        "token_not_found": "Authentication token not found.",
        "invalid_token_payload": "Invalid token payload.",
        "token_expired": "Authentication token has expired.",
        "invalid_token": "Token sio sahihi au umeisha muda wake."
    },
    "user": {
        "email_exists": "Mtumiaji mwenye barua pepe hii tayari yupo.",
        "manager_tenant_required": "tenantId inahitajika kwa usajili wa meneja.",
        "not_found": "Mtumiaji hajapatikana.",
        "get_failed": "Imeshindwa kupata mtumiaji. Tafadhali jaribu tena baadaye.",
        "update_failed": "Imeshindwa kusasisha mtumiaji. Tafadhali jaribu tena baadaye."
    },
    "product": {
        "sku_exists": "Bidhaa yenye SKU hii tayari ipo.",
        "not_found": "Bidhaa haikupatikana.",
        "create_failed": "Imeshindikana kuunda bidhaa. Tafadhali jaribu tena baadaye.",
        "update_failed": "Imeshindikana kusasisha bidhaa. Tafadhali jaribu tena baadaye.",
        "uom_not_found": "Kitengo cha kipimo kilichotajwa hakipatikani."
    },
    "batch": {
        "already_exists": "Kundi lenye nambari hii tayari lipo kwa bidhaa hii.",
        "not_found": "Kundi halikupatikana.",
        "create_failed": "Imeshindwa kuunda kundi. Tafadhali jaribu tena baadaye.",
        "creation_failed": "Uundaji wa kundi umeshindwa: {{reason}}.",
        "list_failed": "Imeshindwa kuorodhesha makundi. Tafadhali jaribu tena baadaye.",
        "query_failed": "Imeshindwa kutafuta makundi. Tafadhali jaribu tena baadaye."
    },
    "inventory_item": {
        "serial_exists": "Kitu cha hesabu chenye namba hii ya msururu tayari kipo.",
        "not_found": "Kitu cha hesabu hakijapatikana.",
        "not_found_by_serial": "Kitu cha hesabu hakijapatikana kwa namba ya msururu.",
        "create_failed": "Imeshindwa kuunda kitu cha hesabu. Tafadhali jaribu tena baadaye.",
        "update_failed": "Imeshindwa kusasisha kitu cha hesabu. Tafadhali jaribu tena baadaye.",
        "list_failed": "Imeshindwa kupata vitu vya hesabu. Tafadhali jaribu tena baadaye.",
        "query_failed": "Imeshindwa kuuliza vitu vya hesabu. Tafadhali jaribu tena baadaye.",
        "search_failed": "Imeshindwa kutafuta kitu cha hesabu. Tafadhali jaribu tena baadaye."
    },
    "stock": {
        "adjust_failed": "Imeshindwa kurekebisha hisa. Tafadhali jaribu tena baadaye.",
        "query_failed": "Imeshindwa kuuliza hisa. Tafadhali jaribu tena baadaye.",
        "list_failed": "Imeshindwa kupata hisa. Tafadhali jaribu tena baadaye."
    },
    "database": {
        "env_missing": "Usanidi wa huduma haujakamilika. Tafadhali wasiliana na msaada.",
        "connect_failed": "Huduma haipatikani kwa sasa. Tafadhali jaribu tena baadaye."
    },
    "supplier": {
        "exists": "Muuzaji mwenye nambari ya simu au barua pepe sawa tayari ipo.",
        "create_failed": "Imeshindikana kuunda muuzaji. Tafadhali jaribu tena baadaye.",
        "check_failed": "Imeshindikana kuthibitisha kuwa muuzaji hajatokana na mwingine. Tafadhali jaribu tena baadaye.",
        "list_failed": "Imeshindikana kupata orodha ya wauzaji. Tafadhali jaribu tena baadaye.",
        "not_found": "Muuzaji hayupo."
    },
    "uom": {
        "exists": "Kitengo cha kipimo chenye msimbo huo tayari kipo.",
        "create_failed": "Imeshindikana kuunda kitengo cha kipimo. Tafadhali jaribu tena baadaye.",
        "list_failed": "Imeshindikana kupata vitengo vya kipimo. Tafadhali jaribu tena baadaye.",
        "base_not_found": "Kitengo cha msingi kilichotajwa hakipatikani.",
        "invalid_factor": "Kiwango cha uongofu si sahihi. Lazima kiwe nambari chanya.",
        "base_exists": "Kimo cha msingi tayari kipo kwa mteja huyu."
    },
    "log": {
        "create_failed": "Imeshindikana kuandika kumbukumbu. Tafadhali jaribu tena baadaye.",
        "list_failed": "Imeshindikana kupata kumbukumbu. Tafadhali jaribu tena baadaye."
    },
    "category": {
        "create": {
            "duplicate": "Jamii yenye jina na aina hii tayari ipo.",
            "parent_type_mismatch": "Aina ya jamii ndogo lazima ilingane na aina ya jamii kuu."
        },
        "not_found": "Jamii haikupatikana.",
        "list": {
            "failed": "Imeshindikana kupata jamii. Tafadhali jaribu tena baadaye."
        },
        "update": {
            "duplicate": "Jamii yenye jina na aina hii tayari ipo."
        },
        "delete": {
            "has_subcategories": "Huwezi kufuta jamii yenye jamii ndogo.",
            "has_transactions": "Huwezi kufuta jamii inayotumika katika miamala."
        },
        "subcategories": {
            "query_failed": "Imeshindikana kupata jamii ndogo. Tafadhali jaribu tena baadaye."
        },
        "tree": {
            "build_failed": "Imeshindikana kujenga mti wa jamii. Tafadhali jaribu tena baadaye."
        }
    },
    "account": {
        "create": {
            "negative_initial_balance": "Salio la mwanzo haliwezi kuwa hasi.",
            "duplicate": "Akaunti yenye jina, aina, na sarafu hiyo tayari ipo."
        },
        "not_found": "Akaunti haikupatikana.",
        "list": {
            "failed": "Imeshindikana kupata akaunti. Tafadhali jaribu tena baadaye."
        },
        "category_required": "Jamii inahitajika kwa ajili ya shughuli hii.",
        "category_invalid": "Jamii sio sahihi. Jamii haikupatikana.",
        "category_type_mismatch": "Aina ya jamii hailingani na aina ya shughuli.",
        "deposit": {
            "failed": "Imeshindikana kuweka pesa kwenye akaunti. Tafadhali jaribu tena baadaye."
        },
        "withdraw": {
            "insufficient_funds": "Hana pesa za kutosha kwa ajili ya kutoa."
        },
        "transfer": {
            "currency_mismatch": "Huwezi kuhamisha kati ya akaunti zenye sarafu tofauti.",
            "insufficient_funds": "Hana pesa za kutosha kwa ajili ya uhamisho.",
            "failed": "Uhamisho umefaula. Muamala umezirudi nyuma."
        },
        "transactions": {
            "query_failed": "Imeshindikana kupata miamala. Tafadhali jaribu tena baadaye."
        }
    }
}